In [1]:
import pandas as pd
import requests
from datetime import timezone

import sqlite3
conn = sqlite3.connect('database.sqlite')
cur = conn.cursor()

In [2]:
cur.execute("""SELECT * FROM matches;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(10)

,Match_ID,Div,Season,Date,HomeTeam,AwayTeam,FTHG,FTAG,FTR
0,1,D2,2009,2010-04-04,Oberhausen,Kaiserslautern,2,1,H
1,2,D2,2009,2009-11-01,Munich 1860,Kaiserslautern,0,1,A
2,3,D2,2009,2009-10-04,Frankfurt FSV,Kaiserslautern,1,1,D
3,4,D2,2009,2010-02-21,Frankfurt FSV,Karlsruhe,2,1,H
4,5,D2,2009,2009-12-06,Ahlen,Karlsruhe,1,3,A
5,6,D2,2009,2010-04-03,Union Berlin,Karlsruhe,1,1,D
6,7,D2,2009,2009-08-14,Paderborn,Karlsruhe,2,0,H
7,8,D2,2009,2010-03-08,Bielefeld,Karlsruhe,0,1,A
8,9,D2,2009,2009-09-26,Kaiserslautern,Karlsruhe,2,0,H
9,10,D2,2009,2009-11-21,Hansa Rostock,Karlsruhe,2,1,H

In [3]:
query="""SELECT * FROM Teams;"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(10)

,Season,TeamName,KaderHome,AvgAgeHome,ForeignPlayersHome,OverallMarketValueHome,AvgMarketValueHome,StadiumCapacity
0,2017,Bayern Munich,27,26,15,597950000,22150000,75000
1,2017,Dortmund,33,25,18,416730000,12630000,81359
2,2017,Leverkusen,31,24,15,222600000,7180000,30210
3,2017,RB Leipzig,30,23,15,180130000,6000000,42959
4,2017,Schalke 04,29,24,17,179550000,6190000,62271
5,2017,M'gladbach,31,25,17,154400000,4980000,54014
6,2017,Wolfsburg,31,24,14,124430000,4010000,30000
7,2017,FC Koln,24,26,9,118550000,4940000,49968
8,2017,Hoffenheim,31,24,14,107330000,3460000,30164
9,2017,Hertha,26,26,12,86800000,3340000,74475

In [5]:
query="""SELECT * FROM Unique_Teams;"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(10)

        TeamName  Unique_Team_ID
0  Bayern Munich               1
1       Dortmund               2
2     Leverkusen               3
3     RB Leipzig               4
4     Schalke 04               5
5     M'gladbach               6
6      Wolfsburg               7
7        FC Koln               8
8     Hoffenheim               9
9         Hertha              10

In [6]:
query="""SELECT * FROM Teams_in_Matches;"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(10)

   Match_ID  Unique_Team_ID
0         1              26
1         1              46
2         2              26
3         2              42
4         3              26
5         3              44
6         4              29
7         4              44
8         5              29
9         5              49

# Data extraction

In [7]:
query="""SELECT Match_ID,Date 
        FROM Matches 
        WHERE season = 2011
        ;"""
cur.execute(query)
df_weather= pd.DataFrame(cur.fetchall())
df_weather.columns = [x[0] for x in cur.description]
print(df_weather.shape)
df_weather.head(10)

(992, 2)

   Match_ID        Date
0      1092  2012-03-31
1      1093  2011-12-11
2      1094  2011-08-13
3      1095  2011-11-27
4      1096  2012-02-18
5      1097  2012-01-20
6      1098  2012-02-04
7      1099  2012-04-21
8      1100  2011-09-18
9      1101  2011-10-23

In [16]:
#We have obtained the list of dates which we will request the wheather as a bolean rainy day
unique_dates = df_weather['Date'].unique()
print(unique_dates,'\n\n')
print(len(unique_dates))
type (unique_dates[0])

['2012-03-31' '2011-12-11' '2011-08-13' '2011-11-27' '2012-02-18'
 '2012-01-20' '2012-02-04' '2012-04-21' '2011-09-18' '2011-10-23'
 '2011-10-01' '2012-03-03' '2011-08-27' '2012-03-17' '2011-11-06'
 '2012-05-05' '2012-04-11' '2011-12-17' '2012-02-03' '2011-10-29'
 '2012-01-22' '2011-12-03' '2012-04-14' '2012-03-25' '2012-03-10'
 '2012-04-07' '2011-11-19' '2011-10-14' '2011-09-24' '2012-04-28'
 '2011-12-18' '2012-03-02' '2012-03-16' '2012-02-17' '2011-08-06'
 '2011-11-04' '2011-09-16' '2011-07-15' '2012-05-06' '2012-02-11'
 '2011-10-02' '2012-03-30' '2011-10-22' '2011-08-26' '2011-08-07'
 '2012-02-24' '2011-07-17' '2012-02-12' '2011-08-22' '2011-09-09'
 '2012-04-01' '2011-09-25' '2012-04-20' '2011-11-25' '2012-03-09'
 '2011-11-07' '2011-09-10' '2011-08-21' '2011-09-26' '2012-03-26'
 '2011-10-30' '2012-02-13' '2012-02-26' '2011-12-19' '2012-03-11'
 '2011-11-26' '2012-04-23' '2011-12-16' '2011-11-05' '2012-04-10'
 '2012-04-15' '2012-02-05' '2012-03-04' '2011-09-17' '2012-01-21'
 '2012-03-18' '2012-04-22' '2011-08-20' '2012-02-10' '2012-02-25'
 '2011-12-10' '2012-01-29' '2011-10-16' '2011-08-05' '2012-03-23'
 '2011-09-23' '2012-01-28' '2011-10-15' '2012-03-24' '2011-11-18'
 '2012-04-29' '2011-12-09' '2012-04-08' '2012-03-12' '2011-07-23'
 '2011-10-28' '2012-01-27' '2011-12-04' '2011-09-11' '2011-09-30'
 '2012-02-19' '2012-04-13' '2011-10-21' '2011-08-14' '2011-09-12'
 '2011-07-18' '2011-08-08' '2011-07-24' '2011-12-13' '2011-08-28'
 '2011-08-19' '2012-03-14' '2011-08-12' '2012-03-05' '2011-12-02'
 '2011-09-19' '2011-07-25' '2012-04-02' '2012-02-06' '2011-11-21'
 '2011-07-22' '2011-08-29' '2012-04-05' '2011-11-28' '2011-12-12'
 '2011-11-20' '2012-02-27' '2011-07-16' '2011-10-31' '2012-02-20'
 '2011-10-17' '2011-12-05' '2012-04-16' '2011-10-03' '2012-03-19'
 '2011-08-15' '2011-12-20' '2011-12-21' '2011-12-22' '2011-12-26'
 '2011-12-27' '2011-12-30' '2011-12-31' '2012-01-01' '2012-01-02'
 '2012-01-03' '2012-01-04' '2012-01-11' '2012-01-14' '2012-01-15'
 '2012-01-16' '2012-01-31' '2012-02-01' '2012-03-13' '2012-03-20'
 '2012-03-21' '2012-04-06' '2012-04-09' '2012-04-24' '2012-04-30'
 '2012-05-01' '2012-05-02' '2012-05-07' '2012-05-08' '2012-05-13']


165

str

In [24]:
#Obtaining total of home goals by each team
query= """SELECT HomeTeam AS Team, SUM(FTHG) AS HomeGoals
          FROM Matches 
          WHERE Season = "2011" 
          GROUP BY Team;"""
cur.execute(query)
df_goals1= pd.DataFrame(cur.fetchall())
df_goals1.columns = [x[0] for x in cur.description]
print(df_goals1.shape)
df_goals1.head()

(56, 2)

            Team  HomeGoals
0         Aachen         15
1        Arsenal         39
2    Aston Villa         20
3       Augsburg         20
4  Bayern Munich         49

In [23]:
#Obtaining total of away goals by each team

query= """SELECT AwayTeam AS Team, SUM(FTAG) AS AwayGoals
          FROM Matches 
          WHERE Season = "2011" 
          GROUP BY Team;"""
cur.execute(query)
df_goals2= pd.DataFrame(cur.fetchall())
df_goals2.columns = [x[0] for x in cur.description]
print(df_goals2.shape)
df_goals2.head()

(56, 2)

            Team  AwayGoals
0         Aachen         15
1        Arsenal         35
2    Aston Villa         17
3       Augsburg         16
4  Bayern Munich         28

In [26]:
#Merging the dataframes df_goals1 and df_goals2

df_goals=df_goals1.merge(df_goals2,on="Team")
print(df_goals.shape)
df_goals.head()

(56, 3)

            Team  HomeGoals  AwayGoals
0         Aachen         15         15
1        Arsenal         39         35
2    Aston Villa         20         17
3       Augsburg         20         16
4  Bayern Munich         49         28

In [28]:
df_goals['TotalGoals']= df_goals['HomeGoals'] + df_goals['AwayGoals']
print(df_goals.shape)
df_goals.head()

(56, 4)

            Team  HomeGoals  AwayGoals  TotalGoals
0         Aachen         15         15          30
1        Arsenal         39         35          74
2    Aston Villa         20         17          37
3       Augsburg         20         16          36
4  Bayern Munich         49         28          77

In [32]:
query= """SELECT HomeTeam AS Team, COUNT(FTR) AS HomeWins
          FROM Matches 
          WHERE Season = "2011" AND FTR ='H'
          GROUP BY Team;"""
cur.execute(query)
df_wins1= pd.DataFrame(cur.fetchall())
df_wins1.columns = [x[0] for x in cur.description]
print(df_wins1.shape)
df_wins1.head()

(56, 2)

            Team  HomeWins
0         Aachen         4
1        Arsenal        12
2    Aston Villa         4
3       Augsburg         6
4  Bayern Munich        14

In [33]:
#Number of away wins
query= """SELECT AwayTeam AS Team, COUNT(FTR) AS AwayWins
          FROM Matches 
          WHERE Season = "2011" AND FTR ='A'
          GROUP BY Team;"""
cur.execute(query)
df_wins2= pd.DataFrame(cur.fetchall())
df_wins2.columns = [x[0] for x in cur.description]
print(df_wins2.shape)
df_wins2.head()

(56, 2)

            Team  AwayWins
0         Aachen         2
1        Arsenal         9
2    Aston Villa         3
3       Augsburg         2
4  Bayern Munich         9

In [35]:
# Add TotalWins columnMerge tables HomeWins and AwayWins

df_wins=df_wins1.merge(df_wins2,on="Team")
print(df_wins.shape)
df_wins.head()

(56, 3)

            Team  HomeWins  AwayWins
0         Aachen         4         2
1        Arsenal        12         9
2    Aston Villa         4         3
3       Augsburg         6         2
4  Bayern Munich        14         9

In [37]:
df_wins['TotalWins']= df_wins['HomeWins'] + df_wins['AwayWins']

In [38]:
# Merge tables df_goals and df_wins
df_teams=df_goals.merge(df_wins,on="Team")
print(df_teams.shape)
df_teams.head()

(56, 7)

,Team,HomeGoals,AwayGoals,TotalGoals,HomeWins,AwayWins,TotalWins
0,Aachen,15,15,30,4,2,6
1,Arsenal,39,35,74,12,9,21
2,Aston Villa,20,17,37,4,3,7
3,Augsburg,20,16,36,6,2,8
4,Bayern Munich,49,28,77,14,9,23

In [45]:
query= """SELECT HomeTeam AS Team, COUNT(FTR) AS HomeLoss
          FROM Matches 
          WHERE Season = "2011" AND FTR ='A'
          GROUP BY Team;"""
cur.execute(query)
df_Loss1= pd.DataFrame(cur.fetchall())
df_Loss1.columns = [x[0] for x in cur.description]
print(df_Loss1.shape)
df_Loss1.head()

(54, 2)

            Team  HomeLoss
0         Aachen         7
1        Arsenal         3
2    Aston Villa         8
3       Augsburg         4
4  Bayern Munich         2

In [44]:
query= """SELECT AwayTeam AS Team, COUNT(FTR) AS AwayLoss
          FROM Matches 
          WHERE Season = "2011" AND FTR ='H'
          GROUP BY Team;"""
cur.execute(query)
df_Loss2= pd.DataFrame(cur.fetchall())
df_Loss2.columns = [x[0] for x in cur.description]
print(df_Loss2.shape)
df_Loss2.head()

(56, 2)

            Team  AwayLoss
0         Aachen         8
1        Arsenal         7
2    Aston Villa         6
3       Augsburg         8
4  Bayern Munich         5

In [54]:
# Merge tables df_goals and df_wins
df_Loss=df_Loss1.merge(df_Loss2,how='outer',on="Team")
print(df_Loss.shape)
df_Loss.head(56)

(56, 3)

                  Team  HomeLoss  AwayLoss
0               Aachen       7.0         8
1              Arsenal       3.0         7
2          Aston Villa       8.0         6
3             Augsburg       4.0         8
4        Bayern Munich       2.0         5
5            Blackburn      12.0        11
6               Bochum       7.0        10
7               Bolton      11.0        11
8         Braunschweig       3.0         6
9              Chelsea       4.0         6
10             Cottbus       5.0        10
11            Dortmund       1.0         2
12             Dresden       4.0         9
13            Duisburg       7.0         8
14       Ein Frankfurt       1.0         5
15      Erzgebirge Aue       5.0        10
16             Everton       6.0         6
17             FC Koln       8.0        12
18  Fortuna Dusseldorf       1.0         3
19       Frankfurt FSV       4.0         9
20            Freiburg       5.0         9
21              Fulham       4.0        10
22      Greuther Furth       2.0         2
23             Hamburg       7.0         7
24       Hansa Rostock       7.0        10
25              Hertha      10.0         7
26          Hoffenheim       4.0         9
27          Ingolstadt       3.0        10
28      Kaiserslautern      10.0         9
29           Karlsruhe       6.0        13
30          Leverkusen       5.0         5
31           Liverpool       4.0        10
32          M'gladbach       1.0         7
33               Mainz       7.0         6
34          Man United       2.0         3
35         Munich 1860       5.0         6
36           Newcastle       3.0         8
37             Norwich       6.0         9
38            Nurnberg       7.0         9
39           Paderborn       2.0         5
40                 QPR       7.0        14
41          Schalke 04       3.0         7
42            St Pauli       2.0         6
43               Stoke       4.0        11
44           Stuttgart       4.0         7
45          Sunderland       5.0        10
46             Swansea       4.0        11
47           Tottenham       3.0         6
48        Union Berlin       4.0        10
49       Werder Bremen       5.0         9
50           West Brom      10.0         7
51               Wigan       7.0        10
52           Wolfsburg       5.0        11
53              Wolves      13.0        10
54            Hannover       NaN        10
55            Man City       NaN         5

In [56]:
df_Loss.isna().any()

Team        False
HomeLoss     True
AwayLoss    False
dtype: bool

In [57]:
df_Loss['HomeLoss'].fillna(0,inplace=True)

In [60]:
df_Loss['TotalLoss']= df_Loss['HomeLoss'] + df_Loss['AwayLoss']
df_Loss.head()

            Team  HomeLoss  AwayLoss  TotalLoss
0         Aachen       7.0         8       15.0
1        Arsenal       3.0         7       10.0
2    Aston Villa       8.0         6       14.0
3       Augsburg       4.0         8       12.0
4  Bayern Munich       2.0         5        7.0

In [61]:
# Merge tables
df_teams=df_teams.merge(df_Loss,on="Team")
print(df_teams.shape)
df_teams.head()

(56, 10)

,Team,HomeGoals,AwayGoals,TotalGoals,HomeWins,AwayWins,TotalWins,HomeLoss,AwayLoss,TotalLoss
0,Aachen,15,15,30,4,2,6,7.0,8,15.0
1,Arsenal,39,35,74,12,9,21,3.0,7,10.0
2,Aston Villa,20,17,37,4,3,7,8.0,6,14.0
3,Augsburg,20,16,36,6,2,8,4.0,8,12.0
4,Bayern Munich,49,28,77,14,9,23,2.0,5,7.0

In [9]:
import json

def get_keys(path):
    with open(path) as f:
        return json.load(f)

In [10]:
keys = get_keys("/Users/abigailsixto/.secret/DarkSky_API.json")

api_key = keys['api_key']

In [17]:
from datetime import timezone

#Format of the required request
# https://api.darksky.net/forecast/[key]/[latitude],[longitude],[time]
latitude= 52.5200
longitude= 13.4050

# dt = datetime(2020,1,25)
# timestamp = int((dt - datetime(1970, 1, 1)).total_seconds())
# timestamp += 12*3600
#It returns timestamp at 12am so 12hours added to make it 12 pm 12*3600seconds 
#print (timestamp)
#url= "https://api.darksky.net/forecast/{}/{},{},{}T?exclude=currently,minutely,hourly,alerts,flags".format(api_key,latitude,longitude,timestamp)
#print(url)
#Have to change format of request due to datetime error
date= unique_dates[0]
url= "https://api.darksky.net/forecast/{}/{},{},{}T12:00:00?exclude=currently,minutely,hourly,alerts,flags".format(api_key,latitude,longitude,date)
response = requests.get(url)
print(response)
print(type(response.text))
print(response.text[:1000])

<Response [200]>
<class 'str'>
{"latitude":52.52,"longitude":13.405,"timezone":"Europe/Berlin","daily":{"data":[{"time":1333144800,"summary":"Drizzle in the morning and afternoon.","icon":"rain","sunriseTime":1333168980,"sunsetTime":1333215600,"moonPhase":0.28,"precipIntensity":0.0005,"precipIntensityMax":0.0049,"precipIntensityMaxTime":1333180920,"precipProbability":0.92,"precipType":"rain","temperatureHigh":45.2,"temperatureHighTime":1333188960,"temperatureLow":29.6,"temperatureLowTime":1333256040,"apparentTemperatureHigh":36.34,"apparentTemperatureHighTime":1333188780,"apparentTemperatureLow":23.96,"apparentTemperatureLowTime":1333256040,"dewPoint":33.58,"humidity":0.7,"windSpeed":17.31,"windGust":40.29,"windGustTime":1333162620,"windBearing":302,"cloudCover":0.71,"uvIndex":3,"uvIndexTime":1333192200,"visibility":6.174,"temperatureMin":38.59,"temperatureMinTime":1333218000,"temperatureMax":47.01,"temperatureMaxTime":1333157640,"apparentTemperatureMin":31.84,"apparentTemperatureMinTime":1333223760,"apparentTempera

In [79]:
data = response.json()
print(type(data))
print(data.keys())

<class 'dict'>
dict_keys(['latitude', 'longitude', 'timezone', 'daily', 'offset'])

In [80]:
print(data['daily'].keys())
data['daily']

dict_keys(['data'])

{'data': [{'time': 1579906800,
   'summary': 'Mostly cloudy throughout the day.',
   'icon': 'partly-cloudy-day',
   'sunriseTime': 1579935600,
   'sunsetTime': 1579966740,
   'moonPhase': 0.03,
   'precipIntensity': 0.0003,
   'precipIntensityMax': 0.0007,
   'precipIntensityMaxTime': 1579927800,
   'precipProbability': 0.14,
   'precipType': 'rain',
   'temperatureHigh': 38.56,
   'temperatureHighTime': 1579960560,
   'temperatureLow': 27.32,
   'temperatureLowTime': 1580010960,
   'apparentTemperatureHigh': 34.07,
   'apparentTemperatureHighTime': 1579960920,
   'apparentTemperatureLow': 22.72,
   'apparentTemperatureLowTime': 1580011020,
   'dewPoint': 28.91,
   'humidity': 0.8,
   'pressure': 1021.9,
   'windSpeed': 5.34,
   'windGust': 15.7,
   'windGustTime': 1579909080,
   'windBearing': 235,
   'cloudCover': 0.7,
   'uvIndex': 1,
   'uvIndexTime': 1579951260,
   'visibility': 10,
   'ozone': 266.1,
   'temperatureMin': 31.87,
   'temperatureMinTime': 1579909560,
   'temperatureMax': 38.56,
   'temperatureMaxTime': 1579960560,
   'apparentTemperatureMin': 26.59,
   'apparentTemperatureMinTime': 1579909320,
   'apparentTemperatureMax': 34.07,
   'apparentTemperatureMaxTime': 1579960920}]}

In [81]:
rainy_data = {}
rainy_data['icon'] = data['daily']['data'][0]['icon']

rainy_data['precipIntensity']= data['daily']['data'][0]['precipIntensity']
rainy_data

{'icon': 'partly-cloudy-day', 'precipIntensity': 0.0003}

In [82]:
#It will be considered a rainy day if 'icon' shows rainy and precipitation > 0.1
def rainyday (rainy_data):
    rainy = False
    if rainy_data['icon'].startswith('rain') and rainy_data['precipIntensity'] > 0.1:
            rainy = True
            
    return rainy

In [83]:
rainyday(rainy_data)

False

In [ ]:
class WeatherGetter():
    rainy_data = {}
    rainy = None
    def __init__(self, latitude=None, longitude=None, date=None)
        self.latitude = latitude
        self.longitude = longitude
        self.date = date